name: "Obj_ensemble"
platform: "ensemble"
max_batch_size: 0
input [
{
  name: "xECAL__0"
  data_type: TYPE_FP32
  dims: [-1, 5]
},
{
  name: "fECAL__1"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "gain__2"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "xES__3"
  data_type: TYPE_FP32
  dims: [-1, 4]
},
{
  name: "fES__4"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "graph_x__5"
  data_type: TYPE_FP32
  dims: [-1, 2]
},
{
  name: "xECAL_batch__6"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "xES_batch__7"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "sb__8"
  data_type: TYPE_INT64
  dims: [-1]
}]
output [
{
  name: "CentralValue__0"
  data_type: TYPE_FP32
  dims: [-1, 6]
},
{
  name: "Resolution__1"
  data_type: TYPE_FP32
  dims: [-1, 5]
}]
ensemble_scheduling{
  step [
  {
    model_name: "Splitter"
    model_version: -1
    input_map {
      key: "xECAL__0"
      value: "xECAL__0"
    }
    input_map {
      key: "fECAL__1"
      value: "fECAL__1"
    }
    input_map {
      key: "gain__2"
      value: "gain__2"
    }
    input_map {
      key: "xES__3"
      value: "xES__3"
    }
    input_map {
      key: "fES__4"
      value: "fES__4"
    }
    input_map {
      key: "graph_x__5"
      value: "graph_x__5"
    }
    input_map {
      key: "xECAL_batch__6"
      value: "xECAL_batch__6"
    }
    input_map {
      key: "xES_batch__7"
      value: "xES_batch__7"
    }
    input_map {
      key: "sb__8"
      value: "sb__8"
    }
    output_map {
      key: "xECALEB__0"
      value: "xECALEB__0"
    }
    output_map {
      key: "fECALEB__1"
      value: "fECALEB__1"
    }
    output_map {
      key: "gainEB__2"
      value: "gainEB__2"
    }
    output_map {
      key: "xESEB__3"
      value: "xESEB__3"
    }
    output_map {
      key: "fESEB__4"
      value: "fESEB__4"
    }
    output_map {
      key: "graph_xEB__5"
      value: "graph_xEB__5"
    }
    output_map {
      key: "xECAL_batchEB__6"
      value: "xECAL_batchEB__6"
    }
    output_map {
      key: "xES_batchEB__7"
      value: "xES_batchEB__7"
    }
    output_map {
      key: "xECALEE__8"
      value: "xECALEE__8"
    }
    output_map {
      key: "fECALEE__9"
      value: "fECALEE__9"
    }
    output_map {
      key: "gainEE__10"
      value: "gainEE__10"
    }
    output_map {
      key: "xESEE__11"
      value: "xESEE__11"
    }
    output_map {
      key: "fESEE__12"
      value: "fESEE__12"
    }
    output_map {
      key: "graph_xEE__13"
      value: "graph_xEE__13"
    }
    output_map {
      key: "xECAL_batchEE__14"
      value: "xECAL_batchEE__14"
    }
    output_map {
      key: "xES_batchEE__15"
      value: "xES_batchEE__15"
    }
  },
  {
    model_name: "ObjEB_ensemble"
    model_version: -1
    input_map {
      key: "xECAL__0"
      value: "xECALEB__0"
    }
    input_map {
      key: "fECAL__1"
      value: "fECALEB__1"
    }
    input_map {
      key: "gain__2"
      value: "gainEB__2"
    }
    input_map {
      key: "xES__3"
      value: "xESEB__3"
    }
    input_map {
      key: "fES__4"
      value: "fESEB__4"
    }
    input_map {
      key: "graph_x__5"
      value: "graph_xEB__5"
    }
    input_map {
      key: "xECAL_batch__6"
      value: "xECAL_batchEB__6"
    }
    input_map {
      key: "xES_batch__7"
      value: "xES_batchEB__7"
    }
    output_map {
      key: "CentralValue__0"
      value: "CentralValueEB__0"
    }
    output_map {
      key: "Resolution__1"
      value: "ResolutionEB__1"
    }
  },
  {
    model_name: "ObjEE_ensemble"
    model_version: -1
    input_map {
      key: "xECAL__0"
      value: "xECALEE__8"
    }
    input_map {
      key: "fECAL__1"
      value: "fECALEE__9"
    }
    input_map {
      key: "gain__2"
      value: "gainEE__10"
    }
    input_map {
      key: "xES__3"
      value: "xESEE__11"
    }
    input_map {
      key: "fES__4"
      value: "fESEE__12"
    }
    input_map {
      key: "graph_x__5"
      value: "graph_xEE__13"
    }
    input_map {
      key: "xECAL_batch__6"
      value: "xECAL_batchEE__14"
    }
    input_map {
      key: "xES_batch__7"
      value: "xES_batchEE__15"
    }
    output_map {
      key: "CentralValue__0"
      value: "CentralValueEE__2"
    }
    output_map {
      key: "Resolution__1"
      value: "ResolutionEE__3"
    }
  },
  {
    model_name: "Merger"
    model_version: -1
    input_map{
      key: "CentralValueEB__0"
      value: "CentralValueEB__0"
    }
    input_map{
      key: "ResolutionEB__1"
      value: "ResolutionEB__1"
    }
    input_map{
      key: "CentralValueEE__2"
      value: "CentralValueEE__2"
    }
    input_map{
      key: "ResolutionEE__3"
      value: "ResolutionEE__3"
    }
    input_map {
      key: "sb__4"
      value: "sb__8"
    }
    output_map {
      key: "CentralValue__0"
      value: "CentralValue__0"
    }
    output_map {
      key: "Resolution__1"
      value: "Resolution__1"
    }
  }
]}
