name: "dummy"
platform: "pytorch_libtorch"
max_batch_size: 100000000
input [
{
  name: "CALQ__0"
  data_type: TYPE_FP32
  dims: [-1, 48]
}]
output [
{
  name: "ECON__0"
  data_type: TYPE_FP32
  dims: [-1, 16]
},
{
  name: "rCALQ__1"
  data_type: TYPE_FP32
  dims: [-1, 48]
}]
