name: "decode"
platform: "pytorch_libtorch"
max_batch_size: 10000000
input [
{
  name: "ECON__0"
  data_type: TYPE_FP32
  dims: [-1, 16]
}]
output [
{
  name: "rCALQ__0"
  data_type: TYPE_FP32
  dims: [-1, 48]
}]
